# NAME: Bhavik Ransubhe
#ROLL NO: 39055
#TE-B COMPUTER DEPARTMENT
#DATA SCIENCE AND VISUALIZATION LAB

#ASSIGNMENT 2

#PROBLEM STATEMENT:
Build training and testing dataset of assignment 1 to predict the probability of a survival of a person
based on gender, age and passenger-class.

# Importing pandas library

In [1]:
import pandas as pd

### Read and load data from train.csv file

In [3]:
df1=pd.read_csv("C:\\Users\\bhavi\\Downloads\\train.csv")

In [4]:
df1.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
df1.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

# Dropping columns

In [6]:
df1.drop(['PassengerId','Name','Ticket','Cabin','SibSp','Parch','Cabin','Embarked'],axis=1,inplace=True)

In [7]:
df1.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

# Information about the data set

In [8]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 5 columns):
Survived    891 non-null int64
Pclass      891 non-null int64
Sex         891 non-null object
Age         714 non-null float64
Fare        891 non-null float64
dtypes: float64(2), int64(2), object(1)
memory usage: 34.9+ KB

In [9]:
df1.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
Fare          0
dtype: int64

In [10]:
df1.Age.describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

# Filling missing values of Age

In [11]:
df1['Age'].fillna(df1['Age'].mean(),inplace=True)

In [12]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 5 columns):
Survived    891 non-null int64
Pclass      891 non-null int64
Sex         891 non-null object
Age         891 non-null float64
Fare        891 non-null float64
dtypes: float64(2), int64(2), object(1)
memory usage: 34.9+ KB

# Converting categorial Sex data into numeric values.

In [13]:
sex_dummies=pd.get_dummies(df1['Sex'],drop_first=True)

# concatenating sex_dummies to dataframe.

In [15]:
df1=pd.concat([df1,sex_dummies],axis=1)

In [16]:
df1.head()

   Survived  Pclass     Sex   Age     Fare  male
0         0       3    male  22.0   7.2500     1
1         1       1  female  38.0  71.2833     0
2         1       3  female  26.0   7.9250     0
3         1       1  female  35.0  53.1000     0
4         0       3    male  35.0   8.0500     1

# Droping sex column from dataframe.

In [17]:
df1.drop(['Sex'],axis=1,inplace=True)

In [18]:
df1.head()

   Survived  Pclass   Age     Fare  male
0         0       3  22.0   7.2500     1
1         1       1  38.0  71.2833     0
2         1       3  26.0   7.9250     0
3         1       1  35.0  53.1000     0
4         0       3  35.0   8.0500     1

# StandardScalar is used for scaling

In [19]:
from sklearn.preprocessing import StandardScaler

In [20]:
sc=StandardScaler()

# Scaling the training data.

In [21]:
feature_scale=['Age','Fare']
df1[feature_scale]=sc.fit_transform(df1[feature_scale])

In [22]:
X=df1.drop(['Survived'],axis=1)

In [23]:
y=df1['Survived']

In [24]:
from sklearn.svm import SVC

In [25]:
model_svc = SVC( C= 100,kernel='rbf')

In [26]:
model_svc.fit(X,y)

C:\Users\bhavi\.Origin\lib\site-packages\sklearn\svm\base.py:193: FutureWarning: The default value of gamma will change from 'auto' to 'scale' in version 0.22 to account better for unscaled features. Set gamma explicitly to 'auto' or 'scale' to avoid this warning.
  "avoid this warning.", FutureWarning)

SVC(C=100, cache_size=200, class_weight=None, coef0=0.0,
    decision_function_shape='ovr', degree=3, gamma='auto_deprecated',
    kernel='rbf', max_iter=-1, probability=False, random_state=None,
    shrinking=True, tol=0.001, verbose=False)

# Reading test.csv file

In [27]:
df2=pd.read_csv("C:\\Users\\bhavi\\Downloads\\test.csv")

In [28]:
df2.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [29]:
df2.tail()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

# Dropping columns

In [30]:
df3=df2.drop(['PassengerId','Name','Ticket','Cabin','SibSp','Parch','Cabin','Embarked'],axis=1)

In [31]:
df3.head()

   Pclass     Sex   Age     Fare
0       3    male  34.5   7.8292
1       3  female  47.0   7.0000
2       2    male  62.0   9.6875
3       3    male  27.0   8.6625
4       3  female  22.0  12.2875

In [32]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 4 columns):
Pclass    418 non-null int64
Sex       418 non-null object
Age       332 non-null float64
Fare      417 non-null float64
dtypes: float64(2), int64(1), object(1)
memory usage: 13.2+ KB

# Displaying number of missing rows in dataset.

In [33]:
df3.isnull().sum()

Pclass     0
Sex        0
Age       86
Fare       1
dtype: int64

# Filling missing values of Age and Fare

In [34]:
df3['Age'].fillna(df3['Age'].mean(),inplace=True)

In [35]:
df3['Fare'].fillna(df3['Fare'].mean(),inplace=True)

In [36]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 4 columns):
Pclass    418 non-null int64
Sex       418 non-null object
Age       418 non-null float64
Fare      418 non-null float64
dtypes: float64(2), int64(1), object(1)
memory usage: 13.2+ KB

# Converting categorial Sex column into numeric values.

In [37]:
sex_dummies1=pd.get_dummies(df3['Sex'],drop_first=True)

In [38]:
df3=pd.concat([df3,sex_dummies1],axis=1)

In [39]:
df3.head()

   Pclass     Sex   Age     Fare  male
0       3    male  34.5   7.8292     1
1       3  female  47.0   7.0000     0
2       2    male  62.0   9.6875     1
3       3    male  27.0   8.6625     1
4       3  female  22.0  12.2875     0

# Droping sex column from dataframe.

In [40]:
df3.drop(['Sex'],axis=1,inplace=True)

In [41]:
df3.head()

   Pclass   Age     Fare  male
0       3  34.5   7.8292     1
1       3  47.0   7.0000     0
2       2  62.0   9.6875     1
3       3  27.0   8.6625     1
4       3  22.0  12.2875     0

# Scaling the training data.

In [42]:
feature_scale=['Age','Fare']
df3[feature_scale]=sc.fit_transform(df3[feature_scale])

In [43]:
df3.head()

   Pclass       Age      Fare  male
0       3  0.334993 -0.498407     1
1       3  1.325530 -0.513274     0
2       2  2.514175 -0.465088     1
3       3 -0.259330 -0.483466     1
4       3 -0.655545 -0.418471     0

In [44]:
y_predict = model_svc.predict(df3)

In [45]:
result = pd.DataFrame({
        "PassengerId": df2['PassengerId'],
        "Survived": y_predict
    })

In [46]:
result.to_csv('TitanicDataset_Result.csv', index=False)